In [1]:
import numpy as np
import pandas as pd

## Creating a DataFrame




*These are the different ways in which one can create a DataFrame*

In [2]:
# Using a Dict with an Index
data = {"a" : [4 ,5, 6], "b" : [7, 8, 9], "c" : [10, 11, 12]}
index = ['Ram', 'Sham', 'Bill']

df = pd.DataFrame(data,index=index)
df

      a  b   c
Ram   4  7  10
Sham  5  8  11
Bill  6  9  12

In [3]:
# Using a List of Lists
data = [[4 ,5, 6], [7, 8, 9], [10, 11, 12]]
col = ['a','b','c']
index = ['Ram', 'Sham', 'Bill']

df = pd.DataFrame(data,index=index,columns=col)
df

       a   b   c
Ram    4   5   6
Sham   7   8   9
Bill  10  11  12

In [4]:
# Using a Dict without an Index
data = {"a" : [4 ,5, 6], "b" : [7, 8, 9], "c" : [10, 11, 12]}
df = pd.DataFrame(data)
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [5]:
# Using List of Dicts
data = [{'a': 4, 'b': 7, 'c':10}, {'a':5, 'b': 8, 'c': 11}, {'a':6, 'b': 9, 'c': 12}]  
df = pd.DataFrame(data) 
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

## Reset Index/Drop Index Row

*To drop the index row*

In [6]:
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [7]:
df.reset_index(inplace = False)

   index  a  b   c
0      0  4  7  10
1      1  5  8  11
2      2  6  9  12

In [8]:
df # Because Inplace is False change is not made in the original

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [9]:
df.reset_index(inplace = True)

In [10]:
df

   index  a  b   c
0      0  4  7  10
1      1  5  8  11
2      2  6  9  12

## df.loc and df.iloc

**loc** *is used when we know the index values or when we represent them in the way they actually are.*

**iloc** *is used when we represent the index numerically.*

Remember that loc and iloc are used to access elements of the dataframe using the index values

In [11]:
# Creating a DataFrame

data = {"a" : [4 ,5, 6], "b" : [7, 8, 9], "c" : [10, 11, 12]}
index = ['Ram', 'Sham', 'Bill']

df = pd.DataFrame(data,index=index)
df

      a  b   c
Ram   4  7  10
Sham  5  8  11
Bill  6  9  12

In [12]:
df.loc['Ram'] # Same as df.iloc[0]
#df.iloc[0]

a     4
b     7
c    10
Name: Ram, dtype: int64

In [13]:
# We want a all the rows where a is greater than 5

df.loc[(df['a'] > 5)] # Same as df[df['a'] > 5] 
# df.iloc[(df['a'] > 5)] will return an error as iloc indexing cannot use an indexable as a mask

      a  b   c
Bill  6  9  12

In [14]:
# Say we want only the 'c' column for all rows where 'b' >= 8

df.loc[df['b'] >= 8, 'c'] # Same as df.loc[df['b'] >= 8]['c']

Sham    11
Bill    12
Name: c, dtype: int64

In [15]:
# We can also use .loc to access particular elements given the index and column

df.loc['Ram']['a'] # Same as df.loc['Ram', 'a']

4

In [16]:
# Say we want to return some n columns for all the indexes

df.loc[:,['a','b']] # Same as df.loc[:][['a','b']]

      a  b
Ram   4  7
Sham  5  8
Bill  6  9

## Groupby 

*Used to split the data based into groups based on some criteria*

In [17]:
df = pd.read_csv("nba.csv") # Let us import the dataframe
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
# Create a group based on the team

obj1 = df.groupby("Team") 

# This will print all the first elements of every group.

obj1.first()

,Name,Number,Position,Age,Height,Weight,College,Salary
Team,,,,,,,,
Atlanta Hawks,Kent Bazemore,24.0,SF,26.0,6-5,201.0,Old Dominion,2000000.0
Boston Celtics,Avery Bradley,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Brooklyn Nets,Bojan Bogdanovic,44.0,SG,27.0,6-8,216.0,Oklahoma State,3425510.0
Charlotte Hornets,Nicolas Batum,5.0,SG,27.0,6-8,200.0,Virginia Commonwealth,13125306.0
Chicago Bulls,Cameron Bairstow,41.0,PF,25.0,6-9,250.0,New Mexico,845059.0
Cleveland Cavaliers,Matthew Dellavedova,8.0,PG,25.0,6-4,198.0,Saint Mary's,1147276.0
Dallas Mavericks,Justin Anderson,1.0,SG,22.0,6-6,228.0,Virginia,1449000.0
Denver Nuggets,Darrell Arthur,0.0,PF,28.0,6-9,235.0,Kansas,2814000.0
Detroit Pistons,Joel Anthony,50.0,C,33.0,6-9,245.0,UNLV,2500000.0
Golden State Warriors,Leandro Barbosa,19.0,SG,33.0,6-3,194.0,North Carolina,2500000.0
Houston Rockets,Trevor Ariza,1.0,SF,30.0,6-8,215.0,UCLA,8193030.0
Indiana Pacers,Lavoy Allen,5.0,PF,27.0,6-9,255.0,Temple,4050000.0
Los Angeles Clippers,Cole Aldrich,45.0,C,27.0,6-11,250.0,Kansas,1100602.0
Los Angeles Lakers,Brandon Bass,2.0,PF,31.0,6-8,250.0,LSU,3000000.0
Memphis Grizzlies,Jordan Adams,3.0,SG,21.0,6-5,209.0,UCLA,1404600.0
Miami Heat,Chris Bosh,1.0,PF,32.0,6-11,235.0,Georgia Tech,22192730.0
Milwaukee Bucks,Giannis Antetokounmpo,34.0,SF,21.0,6-11,222.0,Arizona,1953960.0
Minnesota Timberwolves,Nemanja Bjelica,88.0,PF,28.0,6-10,240.0,Louisville,3950001.0
New Orleans Pelicans,Alexis Ajinca,42.0,C,28.0,7-2,248.0,California,4389607.0
New York Knicks,Arron Afflalo,4.0,SG,30.0,6-5,210.0,UCLA,8000000.0
Oklahoma City Thunder,Steven Adams,12.0,C,22.0,7-0,255.0,Pittsburgh,2279040.0
Orlando Magic,Dewayne Dedmon,3.0,C,26.0,7-0,245.0,USC,947276.0
Philadelphia 76ers,Elton Brand,42.0,PF,37.0,6-9,254.0,Duke,947276.0
Phoenix Suns,Eric Bledsoe,2.0,PG,26.0,6-1,190.0,Kentucky,13500000.0
Portland Trail Blazers,Cliff Alexander,34.0,PF,20.0,6-8,240.0,Kansas,525093.0
Sacramento Kings,Quincy Acy,13.0,SF,25.0,6-7,240.0,Baylor,981348.0
San Antonio Spurs,LaMarcus Aldridge,12.0,PF,30.0,6-11,240.0,Texas,19689000.0
Toronto Raptors,Bismack Biyombo,8.0,C,23.0,6-9,245.0,Missouri,2814000.0
Utah Jazz,Trevor Booker,33.0,PF,28.0,6-8,228.0,Clemson,4775000.0
Washington Wizards,Alan Anderson,6.0,SG,33.0,6-6,220.0,Michigan State,4000000.0

In [19]:
# Now say we ant to groupby both the team and Position

obj2 = df.groupby(["Team", "Position"]) 

# This will print all the first elements of every group.

obj2.first()

                                         Name  Number   Age Height  Weight  \
Team               Position
Atlanta Hawks      C               Al Horford    15.0  30.0   6-10   245.0
                   PF          Kris Humphries    43.0  31.0    6-9   235.0
                   PG         Dennis Schroder    17.0  22.0    6-1   172.0
                   SF           Kent Bazemore    24.0  26.0    6-5   201.0
                   SG        Tim Hardaway Jr.    10.0  24.0    6-6   205.0
...                                       ...     ...   ...    ...     ...
Washington Wizards C            Marcin Gortat    13.0  32.0   6-11   240.0
                   PF             Drew Gooden    90.0  34.0   6-10   250.0
                   PG          Ramon Sessions     7.0  30.0    6-3   190.0
                   SF            Jared Dudley     1.0  30.0    6-7   225.0
                   SG           Alan Anderson     6.0  33.0    6-6   220.0

                                          College      Salary
Team               Position
Atlanta Hawks      C                      Florida  12000000.0
                   PF                   Minnesota   1000000.0
                   PG                 Wake Forest   1763400.0
                   SF                Old Dominion   2000000.0
                   SG                    Michigan   1304520.0
...                                           ...         ...
Washington Wizards C         North Carolina State  11217391.0
                   PF                      Kansas   3300000.0
                   PG                      Nevada   2170465.0
                   SF              Boston College   4375000.0
                   SG              Michigan State   4000000.0

[149 rows x 7 columns]

In [20]:
# Say we want to know the average age of every team

obj1['Age'].mean()

Team
Atlanta Hawks             28.200000
Boston Celtics            24.733333
Brooklyn Nets             25.600000
Charlotte Hornets         26.133333
Chicago Bulls             27.400000
Cleveland Cavaliers       29.533333
Dallas Mavericks          29.733333
Denver Nuggets            25.733333
Detroit Pistons           26.200000
Golden State Warriors     27.666667
Houston Rockets           26.866667
Indiana Pacers            26.400000
Los Angeles Clippers      29.466667
Los Angeles Lakers        27.533333
Memphis Grizzlies         28.388889
Miami Heat                28.933333
Milwaukee Bucks           24.562500
Minnesota Timberwolves    26.357143
New Orleans Pelicans      26.894737
New York Knicks           27.000000
Oklahoma City Thunder     27.066667
Orlando Magic             25.071429
Philadelphia 76ers        24.600000
Phoenix Suns              25.866667
Portland Trail Blazers    25.066667
Sacramento Kings          26.800000
San Antonio Spurs         31.600000
Toronto Raptors           26.133333
Utah Jazz                 24.466667
Washington Wizards        27.866667
Name: Age, dtype: float64

## Adding a new row or column to the dataframe

In [21]:
# Creating a DataFrame

data = {"a" : [4 ,5, 6], "b" : [7, 8, 9], "c" : [10, 11, 12]}
index = ['Ram', 'Sham', 'Bill']

df = pd.DataFrame(data,index=index)
df

      a  b   c
Ram   4  7  10
Sham  5  8  11
Bill  6  9  12

In [22]:
# Adding a new row

df.loc['New Name'] = [1,2,3]

In [23]:
df

          a  b   c
Ram       4  7  10
Sham      5  8  11
Bill      6  9  12
New Name  1  2   3

In [24]:
# Adding a new column

df['d'] = np.random.randint(1, 6, df.shape[0]) 

# Similar to df['d'] = pd.Series(np.random.randint(1,10), index=df.index)

In [25]:
df

          a  b   c  d
Ram       4  7  10  5
Sham      5  8  11  4
Bill      6  9  12  4
New Name  1  2   3  4

## Dropping a Row/Column from a DataFrame

In [26]:
df

          a  b   c  d
Ram       4  7  10  5
Sham      5  8  11  4
Bill      6  9  12  4
New Name  1  2   3  4

In [27]:
df.drop("New Name", axis = 0) # Dropping a row from the Dataframe

# Since Inplace was not set to true the row will still be there in the dataframe.

      a  b   c  d
Ram   4  7  10  5
Sham  5  8  11  4
Bill  6  9  12  4

In [28]:
df.drop("d", axis = 1) # Dropping a column from the DataFrame

# Since Inplace was not set to true the column will still be there in the dataframe.

          a  b   c
Ram       4  7  10
Sham      5  8  11
Bill      6  9  12
New Name  1  2   3

In [29]:
# Permanently Dropping both the 'd' column and the "New Name" row

df.drop("New Name", axis = 0, inplace=True) # Dropping a row from the Dataframe
df.drop("d", axis = 1, inplace=True) # Dropping a column from the DataFrame

In [30]:
df

      a  b   c
Ram   4  7  10
Sham  5  8  11
Bill  6  9  12

In [31]:
# Dropping multiple columns

df.drop(['a','b'],axis = 1) # Same as df.drop(columns=['a','b'],axis = 0)

       c
Ram   10
Sham  11
Bill  12

In [32]:
# Dropping multiple rows

df.drop(df.index[[0,1]])

      a  b   c
Bill  6  9  12

In [33]:
# Dropping rows based on a certain condition

df.drop(df[df['a'] > 5].index) # Dropping rows where the 'a' column has a value greater than 5

      a  b   c
Ram   4  7  10
Sham  5  8  11

## Some other useful Pandas Commands

### Replacing Value(s) in a Column of the DataFrame

In [34]:
df

      a  b   c
Ram   4  7  10
Sham  5  8  11
Bill  6  9  12

In [35]:
df.replace(4,'e') # Replaces the value 4 in the dataframe with the letter 'e'

      a  b   c
Ram   e  7  10
Sham  5  8  11
Bill  6  9  12

### value_counts()

*Used to return the counts of unique values in a given series*

In [36]:
df

      a  b   c
Ram   4  7  10
Sham  5  8  11
Bill  6  9  12

In [37]:
df['a'].value_counts()

6    1
5    1
4    1
Name: a, dtype: int64

### notna()

*Returns True if the values are not null*

In [38]:
df.notna()

         a     b     c
Ram   True  True  True
Sham  True  True  True
Bill  True  True  True

### notnull()

*Similar to notna()*

In [39]:
df.notnull()

         a     b     c
Ram   True  True  True
Sham  True  True  True
Bill  True  True  True

### append()

*Used to append a new row to a given dataframe*


*It also can append a dataframe to the given dataframe*

In [40]:
df1 = pd.DataFrame({"a":[1, 2, 3, 4], "b":[5, 6, 7, 8]}) 
df1

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

In [41]:
# Creating the Second Dataframe using dictionary 
df2 = pd.DataFrame({"a":[1, 2, 3], "b":[5, 6, 7]}) 
df2

   a  b
0  1  5
1  2  6
2  3  7

In [42]:
# to append df2 at the end of df1 dataframe 
df1.append(df2) 

# Notice that the index values are not continuous

   a  b
0  1  5
1  2  6
2  3  7
3  4  8
0  1  5
1  2  6
2  3  7

In [43]:
# A continuous index value will be maintained 
# across the rows in the new appended data frame. 
df1.append(df2, ignore_index = True)

   a  b
0  1  5
1  2  6
2  3  7
3  4  8
4  1  5
5  2  6
6  3  7

In [44]:
# Appending a DataFrame with a different Shape

df3 = pd.DataFrame({"a":[1, 2, 3], "b":[5, 6, 7], "c":[1, 5, 4]}) 
df3 # The new DataFrame we want to append

   a  b  c
0  1  5  1
1  2  6  5
2  3  7  4

In [45]:
df1.append(df3)
# The new cells will be populated with NaNs

   a  b    c
0  1  5  NaN
1  2  6  NaN
2  3  7  NaN
3  4  8  NaN
0  1  5  1.0
1  2  6  5.0
2  3  7  4.0

### dtypes

*To identify the data type of the rows/columns of the dataframe*

In [46]:
df

      a  b   c
Ram   4  7  10
Sham  5  8  11
Bill  6  9  12

In [47]:
df.dtypes

a    int64
b    int64
c    int64
dtype: object

### astype()

*Casting a particular pandas object to a specific dtype*

In [48]:
df = df.astype('float64') #astype has no inplace function
df.dtypes

a    float64
b    float64
c    float64
dtype: object

In [49]:
# To convert only column 'a' back to int

df = df.astype({'a':'int64'})
df.dtypes

a      int64
b    float64
c    float64
dtype: object

### apply()

*The apply() function is used to apply a function along an axis of the DataFrame.*

In [50]:
df

      a    b     c
Ram   4  7.0  10.0
Sham  5  8.0  11.0
Bill  6  9.0  12.0

In [51]:
# Updating the values in the dataframe by replacing them with the square of the number.
df = df.apply(lambda x:x**2) 
df

       a     b      c
Ram   16  49.0  100.0
Sham  25  64.0  121.0
Bill  36  81.0  144.0

In [52]:
df.apply(np.sum, axis=0) # Finding the sum of all elements along every column

a     77.0
b    194.0
c    365.0
dtype: float64

In [53]:
df.apply(np.sum, axis=1) # Finding the sum of all elements along every row

Ram     165.0
Sham    210.0
Bill    261.0
dtype: float64

### pd.to_numeric()

*It converts argument to a numeric type.*

Parameters :

* **errors{â€˜ignoreâ€™, â€˜raiseâ€™, â€˜coerceâ€™}, default â€˜raiseâ€™**
    *  If **â€˜raiseâ€™**, then invalid parsing will raise an exception.

    *  If **â€˜coerceâ€™**, then invalid parsing will be set as NaN.

    *  If **â€˜ignoreâ€™**, then invalid parsing will return the input.
    
    
* **downcast{â€˜integerâ€™, â€˜signedâ€™, â€˜unsignedâ€™, â€˜floatâ€™}, default None**
     * If not **None**, and if the data has been successfully cast to a numerical dtype (or if the data was numeric to begin with), downcast that resulting data to the smallest numerical dtype possible according to the following rules:
         * **â€˜integerâ€™ or â€˜signedâ€™**: smallest signed int dtype (min.: np.int8)
         * **â€˜unsignedâ€™**: smallest unsigned int dtype (min.: np.uint8)
         * **â€˜floatâ€™**: smallest float dtype (min.: np.float32)

In [54]:
s = pd.Series(['1.0', '2', -3])
pd.to_numeric(s)

0    1.0
1    2.0
2   -3.0
dtype: float64

In [55]:
pd.to_numeric(s, downcast='float')

0    1.0
1    2.0
2   -3.0
dtype: float32

In [56]:
pd.to_numeric(s, downcast='signed')

0    1
1    2
2   -3
dtype: int8

In [57]:
s = pd.Series(['apple', '1.0', '2', -3])
pd.to_numeric(s, errors='ignore')

0    apple
1      1.0
2        2
3       -3
dtype: object

In [58]:
# This will return an error
pd.to_numeric(s, errors='raise')

ValueError: Unable to parse string "apple" at position 0

In [59]:
pd.to_numeric(s, errors='coerce') # Replace with NaN

0    NaN
1    1.0
2    2.0
3   -3.0
dtype: float64

### str.contains()

*Used to find the string values in the dataframe*

In [60]:
df = pd.DataFrame(dict(A=[5,3,5,6], C=["foo","bar","fooXYZbar", "bat"]))
df

   A          C
0  5        foo
1  3        bar
2  5  fooXYZbar
3  6        bat

In [61]:
df['C'].str.contains("foo")

0     True
1    False
2     True
3    False
Name: C, dtype: bool

In [62]:
# Return a DataFrame in which the string foo is present
df[df['C'].str.contains("foo")]

   A          C
0  5        foo
2  5  fooXYZbar